benchmark-10.log
====== SET ======
  100000 requests completed in 3.61 seconds
  50 parallel clients
  10 bytes payload
  keep alive: 1

81.24% <= 1 milliseconds
92.61% <= 2 milliseconds
95.48% <= 3 milliseconds
96.81% <= 4 milliseconds
97.80% <= 5 milliseconds
98.26% <= 6 milliseconds
98.57% <= 7 milliseconds
98.83% <= 8 milliseconds
99.13% <= 9 milliseconds
99.18% <= 10 milliseconds
99.23% <= 11 milliseconds
99.44% <= 12 milliseconds
99.49% <= 13 milliseconds
99.54% <= 14 milliseconds
99.58% <= 15 milliseconds
99.64% <= 16 milliseconds
99.69% <= 17 milliseconds
99.74% <= 26 milliseconds
99.75% <= 27 milliseconds
99.79% <= 29 milliseconds
99.79% <= 33 milliseconds
99.82% <= 49 milliseconds
99.82% <= 50 milliseconds
99.83% <= 52 milliseconds
99.84% <= 55 milliseconds
99.84% <= 57 milliseconds
99.85% <= 65 milliseconds
99.85% <= 69 milliseconds
99.86% <= 70 milliseconds
99.86% <= 71 milliseconds
99.88% <= 100 milliseconds
99.88% <= 101 milliseconds
99.88% <= 110 milliseconds
99.89% <= 111 milliseconds
99.89% <= 112 milliseconds
99.90% <= 114 milliseconds
99.90% <= 115 milliseconds
99.90% <= 122 milliseconds
99.91% <= 123 milliseconds
99.93% <= 153 milliseconds
99.94% <= 154 milliseconds
99.95% <= 238 milliseconds
99.96% <= 239 milliseconds
100.00% <= 240 milliseconds
27723.87 requests per second

====== GET ======
  100000 requests completed in 4.85 seconds
  50 parallel clients
  10 bytes payload
  keep alive: 1

57.69% <= 1 milliseconds
84.73% <= 2 milliseconds
90.79% <= 3 milliseconds
93.89% <= 4 milliseconds
95.93% <= 5 milliseconds
96.89% <= 6 milliseconds
97.57% <= 7 milliseconds
98.11% <= 8 milliseconds
98.39% <= 9 milliseconds
98.58% <= 10 milliseconds
98.86% <= 11 milliseconds
99.04% <= 12 milliseconds
99.19% <= 13 milliseconds
99.28% <= 14 milliseconds
99.44% <= 15 milliseconds
99.50% <= 16 milliseconds
99.57% <= 17 milliseconds
99.61% <= 18 milliseconds
99.65% <= 19 milliseconds
99.69% <= 20 milliseconds
99.72% <= 21 milliseconds
99.75% <= 22 milliseconds
99.75% <= 23 milliseconds
99.75% <= 24 milliseconds
99.79% <= 27 milliseconds
99.81% <= 28 milliseconds
99.81% <= 31 milliseconds
99.81% <= 36 milliseconds
99.84% <= 38 milliseconds
99.84% <= 39 milliseconds
99.87% <= 40 milliseconds
99.88% <= 42 milliseconds
99.89% <= 43 milliseconds
99.89% <= 48 milliseconds
99.90% <= 52 milliseconds
99.92% <= 67 milliseconds
99.96% <= 136 milliseconds
99.96% <= 137 milliseconds
99.99% <= 139 milliseconds
99.99% <= 144 milliseconds
100.00% <= 145 milliseconds
100.00% <= 145 milliseconds
20618.56 requests per second