benchmark-20.log
====== SET ======
  100000 requests completed in 4.29 seconds
  50 parallel clients
  20 bytes payload
  keep alive: 1

55.34% <= 1 milliseconds
87.40% <= 2 milliseconds
93.63% <= 3 milliseconds
96.08% <= 4 milliseconds
97.53% <= 5 milliseconds
98.52% <= 6 milliseconds
99.02% <= 7 milliseconds
99.17% <= 8 milliseconds
99.33% <= 9 milliseconds
99.44% <= 10 milliseconds
99.57% <= 11 milliseconds
99.59% <= 12 milliseconds
99.67% <= 13 milliseconds
99.72% <= 14 milliseconds
99.77% <= 15 milliseconds
99.82% <= 16 milliseconds
99.85% <= 17 milliseconds
99.90% <= 18 milliseconds
99.94% <= 19 milliseconds
99.94% <= 21 milliseconds
99.96% <= 22 milliseconds
99.96% <= 23 milliseconds
99.98% <= 24 milliseconds
99.98% <= 25 milliseconds
99.98% <= 26 milliseconds
99.98% <= 28 milliseconds
99.98% <= 29 milliseconds
99.99% <= 30 milliseconds
99.99% <= 288 milliseconds
100.00% <= 288 milliseconds
23288.31 requests per second

====== GET ======
  100000 requests completed in 4.20 seconds
  50 parallel clients
  20 bytes payload
  keep alive: 1

64.58% <= 1 milliseconds
89.43% <= 2 milliseconds
94.16% <= 3 milliseconds
95.97% <= 4 milliseconds
97.55% <= 5 milliseconds
98.18% <= 6 milliseconds
98.50% <= 7 milliseconds
98.64% <= 8 milliseconds
98.78% <= 9 milliseconds
98.86% <= 10 milliseconds
98.96% <= 11 milliseconds
99.04% <= 12 milliseconds
99.17% <= 13 milliseconds
99.32% <= 14 milliseconds
99.43% <= 15 milliseconds
99.52% <= 16 milliseconds
99.56% <= 17 milliseconds
99.59% <= 18 milliseconds
99.60% <= 19 milliseconds
99.67% <= 20 milliseconds
99.69% <= 21 milliseconds
99.73% <= 22 milliseconds
99.88% <= 23 milliseconds
99.92% <= 24 milliseconds
99.93% <= 26 milliseconds
99.93% <= 27 milliseconds
99.93% <= 28 milliseconds
99.94% <= 29 milliseconds
99.95% <= 32 milliseconds
99.95% <= 37 milliseconds
99.95% <= 38 milliseconds
99.96% <= 66 milliseconds
99.96% <= 78 milliseconds
99.96% <= 226 milliseconds
99.96% <= 281 milliseconds
99.98% <= 282 milliseconds
100.00% <= 282 milliseconds
23781.21 requests per second