benchmark-2000.log
====== SET ======
  100000 requests completed in 3.14 seconds
  50 parallel clients
  2000 bytes payload
  keep alive: 1

71.86% <= 1 milliseconds
92.59% <= 2 milliseconds
96.16% <= 3 milliseconds
97.66% <= 4 milliseconds
98.53% <= 5 milliseconds
98.94% <= 6 milliseconds
99.22% <= 7 milliseconds
99.42% <= 8 milliseconds
99.51% <= 9 milliseconds
99.58% <= 10 milliseconds
99.69% <= 11 milliseconds
99.78% <= 12 milliseconds
99.78% <= 13 milliseconds
99.80% <= 14 milliseconds
99.83% <= 16 milliseconds
99.84% <= 17 milliseconds
99.87% <= 18 milliseconds
99.88% <= 19 milliseconds
99.91% <= 21 milliseconds
99.91% <= 25 milliseconds
99.92% <= 34 milliseconds
99.93% <= 37 milliseconds
99.93% <= 38 milliseconds
99.95% <= 39 milliseconds
99.96% <= 48 milliseconds
99.97% <= 49 milliseconds
99.98% <= 75 milliseconds
99.98% <= 77 milliseconds
99.99% <= 78 milliseconds
100.00% <= 78 milliseconds
31796.50 requests per second

====== GET ======
  100000 requests completed in 2.63 seconds
  50 parallel clients
  2000 bytes payload
  keep alive: 1

77.57% <= 1 milliseconds
95.14% <= 2 milliseconds
98.27% <= 3 milliseconds
99.23% <= 4 milliseconds
99.60% <= 5 milliseconds
99.76% <= 6 milliseconds
99.81% <= 7 milliseconds
99.82% <= 8 milliseconds
99.84% <= 9 milliseconds
99.85% <= 10 milliseconds
99.91% <= 11 milliseconds
99.91% <= 12 milliseconds
99.93% <= 13 milliseconds
99.95% <= 14 milliseconds
99.95% <= 15 milliseconds
99.96% <= 16 milliseconds
99.98% <= 17 milliseconds
100.00% <= 20 milliseconds
37993.92 requests per second